/* =====================
   目的地 → 唯一走廊口
===================== */

const DEST_CONFIG = {
    "机场1": "URGEB",
    "机场2": "P36",
    "机场3": "TULMU",
    "机场4": "OLMIB",
    "机场5": "GUGAM",
    "机场6": "BENBI"
};

/* =====================
   表头固定顺序
===================== */

const FIX_ORDER = ["URGEB", "P36", "TULMU", "OLMIB", "GUGAM", "BENBI"];

/* =====================
   能力配置（与你截图一致）
===================== */

const SID_TABLE = {
    RNAV: {
        "01L": {
            URGEB: ["9", "7"],
            P36: ["X"],
            TULMU: ["5"],
            OLMIB: ["9", "7", "5"],
            GUGAM: ["9", "7", "5"],
            BENBI: ["9", "7"]
        },
        "01R": {
            URGEB: ["9", "7"],
            P36: ["X"],
            TULMU: ["5", "3"],
            OLMIB: ["9", "7", "5"],
            GUGAM: ["9", "7", "5"],
            BENBI: ["9", "7"]
        },
        "19L": {
            URGEB: ["9"],
            P36: ["X"],
            TULMU: ["5", "3"],
            OLMIB: ["9", "5"],
            GUGAM: ["9", "5"],
            BENBI: ["9"]
        },
        "19R": {
            URGEB: ["9"],
            P36: ["X"],
            TULMU: ["5", "3"],
            OLMIB: ["9", "5"],
            GUGAM: ["9", "5"],
            BENBI: ["9"]
        }
    },

    TRAN: {
        "01L": {
            URGEB: ["8", "6","RV"],
            P36: ["W","RV"],
            TULMU: ["4","RV"],
            OLMIB: ["8", "6", "4","RV"],
            GUGAM: ["8", "6", "4","RV"],
            BENBI: ["8", "6","RV"]
        },
        "01R": {
            URGEB: ["8", "6","RV"],
            P36: ["W","RV"],
            TULMU: ["4","RV"],
            OLMIB: ["8", "6", "4","RV"],
            GUGAM: ["8", "6", "4","RV"],
            BENBI: ["8", "6","RV"]
        },
        "19L": {
            URGEB: ["8","RV"],
            P36: ["W","RV"],
            TULMU: ["4", "2","RV"],
            OLMIB: ["8", "4","RV"],
            GUGAM: ["8", "4","RV"],
            BENBI: ["8","RV"]
        },
        "19R": {
            URGEB: ["8","RV"],
            P36: ["W","RV"],
            TULMU: ["4", "2","RV"],
            OLMIB: ["8", "4","RV"],
            GUGAM: ["8", "4","RV"],
            BENBI: ["8","RV"]
        }
    }
};
